#!/usr/bin/env python
# -*- coding: utf-8 -*-

class ERR:
    # 错误码定义
    # base 基础8位,每种类型错误 前2位需要区分

    class DOWNLOAD:
        BASE = 5000 * 10000
        {
            "50001001": "指定目录不存在或非文件夹目录",
            "50002001": "部分url文件不存在",
            "50002002": "全部url文件不存在",
            "50002003": "输入url为空",
            "50000001": "执行download函数时抛出异常",
        }

    class RUNCMD:
        BASE = 5100 * 10000
        {
            "51001001": "cmd命令执行失败",
            "51000001": "执行runCmd函数时抛出异常",
        }

    class HISTORY:
        BASE = 5200 * 10000
        {
            "52001001": "数据库查询数据出错",
            "52000001": "执行history函数时抛出异常",
        }

    class OPERATEDB:
        BASE = 5300 * 10000
        {
            "53001001": "数据库写入download出错",
            "53002001": "数据库写入cmd出错",
            "53003001": "数据库写入history出错",
        }

    class USER:
        BASE = 5400 * 10000
        {
            "54000001" : "未输入用户名"
        }